<!DOCTYPE html>
<html lang="es">
<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <!-- Estilos CSS -->
    <link rel="stylesheet" href="./css/style.css">
    <!-- Agrego etiquetas para poder cambiar de fuente la página -->
    <link rel="preconnect" href="https://fonts.googleapis.com">
    <link rel="preconnect" href="https://fonts.gstatic.com" crossorigin>
    <link href="https://fonts.googleapis.com/css2?family=Montserrat:ital,wght@0,100..900;1,100..900&family=Poppins:ital,wght@0,100;0,200;0,300;0,400;0,500;0,600;0,700;0,800;0,900;1,100;1,200;1,300;1,400;1,500;1,600;1,700;1,800;1,900&display=swap" rel="stylesheet">
    <!-- Título de mi página -->
    <title>Linea del tiempo | Evoluci&oacute;n de las aplicaciones web</title>
</head>
<body>
    <div align="CENTER" style="margin-top: 20px;">
        <!-- Cabecera del archivo -->
        <table width="90%" border="0">
            <tr>
                <td width="200px" align="LEFT"><img src="./img/TecNM-logo.svg" class="logo-1" alt="Tecnológico Nacional de México"></td>
                <td align="CENTER"></td>
                <td width="200px" align="RIGHT"><img src="./img/itorizaba-logo.png" class="logo-2" alt="Instituto Tecnológico de Orizaba"></td>
            </tr>
        </table>

        <h1 class="titulo">Linea del tiempo</h1>
        <iframe width="415" height="315" src="https://www.youtube.com/embed/mFnRAPHrbN4?si=IYFrzc9mafAhc836" title="YouTube video player" frameborder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share" referrerpolicy="strict-origin-when-cross-origin" allowfullscreen></iframe><br><br><br>
        <table width="90%" border="1" id="customers">
            <caption>Evoluci&oacute;n de las aplicaciones web</caption>
            <tr>
                <th width="10%">Hitos</th>
                <th width="35%">Hechos</th>
                <th colspan="2">Imagenes</th>
                <th width="30%">Referencias</th>
            </tr>
            <tr>
                <td align="CENTER">Internet</td>
                <td class="celda">
                    <p><strong>1969 - ARPANET: </strong>Se estableci&oacute; la primera conexi&oacute;n de computadoras conocida como ARPANET, entre las universidades de California y Utah.</p>

                    <p><strong>1983 - TCP / IP: </strong>ARPANET cambi&oacute; el protocolo NCP, el cual fue dise&ntilde;ado para gestionar la comunicaci&oacute;n entre computadoras en la red por TCP/IP.</p>

                    <p><strong>1989 - OSI: </strong>Integraci&oacute;n de los protocolos OSI en la arquitectura de Internet, facilitando el uso de distintos protocolos de comunicaci&oacute;n.</p>
                </td>
                <td align="CENTER"><img src="./img/internet-1.png" alt="Historia del internet"></td>
                <td align="CENTER"><img src="./img/internet-2.png" alt="Tim Berners Lee"></td>
                <td rowspan="5" class="celda-2">
                    <!-- Referencias -->
                    <p>S.F. (26 de febrero de 2024). Historia de internet. Obtenido de <a href="https://www.fib.upc.edu/retro-informatica/historia/internet.html" target="_blank">https://www.fib.upc.edu/retro-informatica/historia/internet.html</a></p>

                    <p>Latorre Ariño M. (28 de marzo del 2018). HISTORIA DE LA WEB, 1.0, 2.0, 3.0 Y 4.0. Obtenido de: <a href="https://marinolatorre.umch.edu.pe/historia-de-la-web-1-0-2-0-3-0-y-4-0/" target="_blank">https://marinolatorre.umch.edu.pe/historia-de-la-web-1-0-2-0-3-0-y-4-0/</a></p>
                </td>
            </tr>
            <tr>
                <td align="CENTER" >Web 1.0</td>
                <td class="celda">
                    <div>
                        <p><strong>1990 - MILNET / INTERNET: </strong><em>ARPANET</em> se desmantela y aparecen:</p>
                        <ul>
                            <li><em>MILNET</em> de naturaleza militar.</li>
                            <li><em>INTERNET</em> de naturaleza publica.</li>
                        </ul>
                    </div>

                    <div>
                        <p><strong>1991 - WWW: </strong><em>Tim Berners Lee</em> crea la <em>WORLD WIDE WEB</em>, m&aacute;s conocida como <em>WWW</em>, adem&aacute;s, propuso un nuevo sistema de hipertexto para compartir documentos.</p>
                        <ul>
                            <li><em>HTML</em> (HiperText Markup Language).</li>
                        </ul>
                    </div>

                    <p><strong>1992 - TABLE BASE WEB: </strong>Permitían organizar el texto en columnas y mantener la informaci&oacute;n separada a lo largo de la p&aacute;gina. Proporcionaban una mayor posibilidad de dise&ntilde;o aunque su manejo era bastante complejo.</p>

                    <p><strong>1995 - HTML 2.0: </strong>HTML 2.0 fue publicado como una especificaci&oacute;n por el <em>IETF</em> (Internet Engineering Task Force). HTML 2.0 introdujo el soporte b&aacute;sico para formularios web, permitiendo a los usuarios enviar datos a trav&eacute;s de la web.</p>

                    <p><strong>1996 - CSS: </strong>El Consorcio W3C introdujo <em>Cascading Style Sheets (CSS)</em> como una soluci&oacute;n para mejorar la presentaci&oacute;n y el dise&ntilde;o de las p&aacute;ginas web. CSS es un lenguaje de estilo utilizado para describir la apariencia visual y el formato de un documento HTML.</p>

                    <p><strong>1997 - HTML 4.0: </strong><em>HTML 4.0</em> Fue lanzado como una especificaci&oacute;n oficial por el W3C en diciembre de 1997. Esta versi&oacute;n trajo consigo mejoras significativas, incluyendo la introducci&oacute;n de hojas de estilo (CSS) como un componente separado para el dise&ntilde;o y formato de las p&aacute;ginas web.</p>

                    <p><strong>1998 - GOOGLE: </strong><em>Google</em> se funda y se convierte en un motor de b&uacute;squeda clave. Google se lanz&oacute; como un motor de b&uacute;squeda en l&iacute;nea que se destacaba por su enfoque en la relevancia y calidad de los resultados de b&uacute;squeda.</p>
                </td>
                <td align="CENTER"><img src="./img/web1.png" alt="Web1.0"></td>
                <td align="CENTER"><img src="./img/web1_0-1.svg" alt="Html1.0"><img src="./img/web1_0-2.png" alt="CSS"></td>
            </tr>
            <tr>
                <td align="CENTER" >Web 2.0</td>
                <td class="celda">
                    <p><strong>2001 - WIKIPEDIA: </strong><em>Wikipedia</em> fue lanzada como una enciclopedia en l&iacute;nea de acceso gratuito y colaborativo. Fue fundada por Jimmy Wales y Larry Sanger con el objetivo de crear una plataforma donde cualquier persona pudiera contribuir y editar contenidos.</p>

                    <p><strong>2004 - FACEBOOK: </strong><em>Mark Zuckerberg</em> y sus compa&ntilde;eros de habitaci&oacute;n de la Universidad de Harvard lanzaron la plataforma social conocida como <em>Facebook</em>. Permitía a los usuarios crear perfiles, compartir fotos, actualizar su estado y conectarse con amigos.</p>

                    <p><strong>2005 - YOUTUBE: </strong><em>YouTube</em> fue lanzado en febrero de 2005 por tres antiguos empleados de PayPal: <em>Steve Chen, Chad Hurley y Jawed Karim</em>. La plataforma permit&iacute;a a los usuarios cargar, ver y compartir videos.</p>

                    <p><strong>2007 - IPHONE: </strong>Apple lanza el <em>iPhone</em>, marcando el inicio de la era de los tel&eacute;fonos inteligentes y el acceso m&oacute;vil a Internet.</p>
                </td>
                <td align="CENTER"><img src="./img/web2.png" alt="Web2.0"></td>
                <td align="CENTER"><img src="./img/web2_0-1.png" alt="Facebook"><img src="./img/web2_0-2.png" alt="YouTube"></td>
            </tr>
            <tr>
                <td align="CENTER">Web 3.0</td>
                <td class="celda">
                    <p><strong>2012 - SCHEMA: </strong><em>Schema.org</em> se lanza como una colaboraci&oacute;n entre Google, Microsoft, Yahoo y Yandex para crear un vocabulario común para la marcaci&oacute;n de datos estructurados en p&aacute;ginas web.</p>

                    <p><strong>2013 - TWITCH: </strong><em>Twitch</em> se centr&oacute; en la transmisi&oacute;n en vivo de contenido relacionado con videojuegos y eventos de eSports.</p>

                    <p><strong>2014 - SOLID: </strong><em>Solid</em>, un proyecto liderado por Tim Berners Lee en el MIT, se anuncia como una plataforma para empoderar a los usuarios con el control de sus propios datos en la web.</p>

                    <p><strong>2014 - HTML5: </strong><em>HTML5</em> trajo consigo una serie de mejoras y características nuevas en comparaci&oacute;n con sus predecesores, incluyendo soporte integrado para contenido multimedia, gr&aacute;ficos vectoriales, mejoras en la accesibilidad, y una mayor capacidad para crear aplicaciones web interactivas.</p>
                </td>
                <td align="CENTER"><img src="./img/web3.png" alt="Web3.0"></td>
                <td align="CENTER"><img src="./img/web3_0-2.png" alt="HTML5"><img src="./img/web3_0-1.png" alt="Twitch"></td>
            </tr>
            <tr>
                <td align="CENTER">Web 4.0</td>
                <td class="celda">
                    <p><strong>2015 - WHATSAPP WEB: </strong>Esta funci&oacute;n permiti&oacute; a los usuarios de WhatsApp acceder a sus mensajes y conversaciones a trav&eacute;s de una interfaz web, lo que facilit&oacute; la comunicaci&oacute;n desde computadoras de escritorio.</p>

                    <p><strong>2015 - ETHEREUM: </strong>La Fundaci&oacute;n Ethereum lanza la <em>red Ethereum</em>, una plataforma blockchain que permite la creaci&oacute;n de contratos inteligentes, proporcionando un entorno descentralizado para aplicaciones.</p>
                </td>
                <td align="CENTER"><img src="./img/web4.png" alt="Web4.0"></td>
                <td align="CENTER"><img src="./img/web4_0-2.png" alt="ETHEREUM"></td>
            </tr>
        </table>
    </div>
</body>
</html>